{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":[["^(Your mom is taking all of your games! Defend the grounds!)","\n","^You: What are you doing!? Put those back!!","\n","^Mom: Absolutely not. You've lost your privilege until you can improve your grades.","\n","^You: My grades are fine!","\n","^Mom: Have you even looked at your last report card? You failed two classes!! What's gotten into you lately?","\n","^You: I don't know what you're talking about. I'm fine...","\n","^Mom: Well I can see how you failed English, because that argument isn't good enough.","\n","^You: Just get off my back!","\n","^Mom: Well, you left me no choice! You don't seem to realize how important school is.","\n","^You: School doesn’t matter.... I can figure out things on my own!","\n","^Mom: The past few years have shown me that you won't. You hole up in here all day and you don't show interest in anything.","\n","^You: What do you want from me!?","\n","^Mom: Well, for starters, why don't you do your homework?","\n","ev","str","^Do what she says","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Argue back","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"good_choice"},"\n",{"#f":5}],"c-1":["^ ",{"->":"bad_choice"},"\n",{"#f":5}]}],{"#f":1}],"bad_choice":["^You: You're so annoying... Stop pretending to care about me...","\n","^Mom: I am your mother. Of course I care about you. But you're spending way too much time on these games.","\n","^Mom: If you waste your time in school, it'll come back to bite you HARD in the future. You'll be stuck at a job you hate, if you even get a job at all!","\n","^You: School sucks! I don’t learn anything.","\n","^Mom: I have a hard time believing that. Have you been trying your best? Have you actually TRIED to learn in your classes?","\n","^Mom: Honestly, I don't see that from you...","\n","^You: Are you calling me stupid? SHUT UP MOM!","\n","^(Mom slaps you)","\n","^Mom: DON’T SPEAK TO ME THAT WAY!!","\n","^Mom: You better shape up right now!","\n","^You: I don't have to listen to you!","\n","^You: I hate school, and you can't make me go back ever again!","\n","end",{"#f":1}],"good_choice":[["^You: Ok, OK! I'll do it... Will you give me my games back then?","\n","^Mom: No. I'm sorry, but there's a bigger problem here.","\n","^Mom: You need to be responsible. You need to have discipline. Until you can show that to me, I can't give you your games back.","\n","^You: Why do I have to do all that? School won't help me at all!","\n","^Mom: If you actually put your best effort in it, you might feel differently.","\n","^You: No, I know for sure. Nothing good has ever happened to me at school. Not since...","\n","^Mom: Not since?","\n","^You: ...nothing. Just leave me alone.","\n","^Mom: ...","\n","^Mom: Are you talking about what happened with Jason?","\n","^You: !!","\n","^Mom: I understand that middle school was rough, and I know having your friendship fall out didn't help that. But please, talk to me.","\n","^Mom: I can't help you if you're not willing to help yourself.","\n","ev","str","^Maybe she's right...","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^She's wrong!","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"good_outcome"},"\n",{"#f":5}],"c-1":["^ ",{"->":"bad_outcome"},"\n",{"#f":5}]}],{"#f":1}],"bad_outcome":["^You: OH, so it's MY fault!?","\n","^Mom: No! That's not what I'm saying. Please just let me help you...","\n","^You: I don’t need your help. I don’t WANT your help. I don’t need this. I’m not going to school anymore.","\n","^Mom: Martin...","\n","^You: LEAVE ME ALONE!","\n","end",{"#f":1}],"good_outcome":["^You: But......","\n","^Mom: I know it's hard, but I'm here for you. Just like how I want you to do your best, I want to do my best for you.","\n","^You: But..... what if it still doesn't work out? What if bad things keep happening?","\n","^Mom: I guarantee you that won't happen. If you do the best you can, people will reach out to you and help you up.","\n","^Mom: You already have me, your dad, and you can even talk to your teachers. You're not alone.","\n","^You: ...thanks, Mom","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}